# Pandas 

> <h> Chapter 1. Preparing data </h>

1.1 Reading multiple datafiles

1.2 Reindexing Dataframes

1.3 Arithmetic with Series & DataFrames

In [2]:
import pandas as pd

### read the dataframe

The primary tool we can use for data import is read_csv. This function accepts the file path of a comma-separated values(CSV) file as input and returns a panda’s data frame directly.

In [8]:
# read the (sales-jan-2015) dataset.

df = pd.read_csv("sales-jan-2015.csv")

pandas has other convenient tools with similar default calling syntax that import various data formats into data frames:

1. pd.read_excel() #for importing excel files
2. pd.read_html() #for importing html data
3. pd.read_json() #for importing json data

To read multiple files using pandas, we generally need separate data frames.

In [5]:
# read the datasets sepatetly (sales-jan-2015 and sales-feb-2015)

df0 = pd.read_csv("sales-jan-2015.csv")
df1 = pd.read_csv("sales-feb-2015.csv")

### Using a loop

It’s generally more efficient to iterate over a collection of file names. With that goal, we can create a list of filenames with the two file parts from before. We then initialize an empty list called dataframes and iterate through the list of filenames. Within each iteration we invoke read_csv to read a dataframe from a file and we append the resulting data frame to the dataframes list.

In [10]:
# read the datasets ("sales-feb-2015","sales-jan-2015") using a loop

filename = ["sales-jan-2015.csv","sales-feb-2015.csv"]
dataframes = []
for f in filename:
    dataframes.append(pd.read_csv(f))

### Using glob

When many file names have a similar pattern, that glob module from the Python Standard Library is very useful.
We use the pattern sales*.csv to match any strings that start with the prefix sales and end with the suffix .csv.

In [11]:
# read the datasets ("sales-jan-2015") using a glob

from glob import glob
file = glob("sales-jan-2015")
df2 = [pd.read_csv(f) for f in file]

### Reindexing dataframe

~ Sorting dataframe with index and columns. 

~ Reindexing dataframe from a list.

**Important arguments are**,

axis : If axis is 0, then dataframe will sorted based on row index labels. Default is 0
       If axis is 1, then dataframe will sorted based on column names.

ascending : If True sort in ascending else sort in descending order. Default is True

inplace : If True, perform operation in-place in Dataframe

na_position : Decides the position of NaNs after sorting i.e. irst puts NaNs at the beginning, last puts NaNs at the end
Default value is ‘first’

In [19]:
# Create a dataframe

import numpy as np
import pandas as pd
data = {'county': ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data)
df

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3

In [22]:
#sort the table with columns
df.sort_values('reports')

       county  year  reports
3    Maricopa  2014        2
4        Yuma  2014        3
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31

In [10]:
# sorting table with index

df.sort_index()

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3

In [25]:
# Change the order (the index) of the rows

df.sort_index(axis=0,ascending=False)

       county  year  reports
4        Yuma  2014        3
3    Maricopa  2014        2
2  Santa Cruz  2013       31
1        Pima  2012       24
0     Cochice  2012        4

In [26]:
# reindexing from the dataframe index

df1=df.reindex(df.index)
print(df1)

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3

### Arithmetic with series and dataframes

In [28]:
# load the date sets
sales1 = pd.read_csv("sales-feb-2015.csv")
sales2 = pd.read_csv("sales-jan-2015.csv")

In [29]:
sales1.head()

    Product  Units
0   Service      4
1  Software     10
2  Software     13
3  Software      3
4   Service     10

In [30]:
#mean value
sales1.mean(axis = 0)

Units    8.8
dtype: float64

In [32]:
# percentage change
sales1['Units'].pct_change()*100

0            NaN
1     150.000000
2      30.000000
3     -76.923077
4     233.333333
5      90.000000
6       0.000000
7     -63.157895
8     100.000000
9     -50.000000
10    -85.714286
11    300.000000
12    -75.000000
13    900.000000
14     30.000000
15    -23.076923
16     60.000000
17    -43.750000
18    -66.666667
19      0.000000
Name: Units, dtype: float64

In [22]:
# Adding sales1 and sales2 
sales1 + sales2

             Product  Units
0    ServiceHardware     15
1    SoftwareService     18
2   SoftwareHardware     30
3   SoftwareHardware     19
4    ServiceHardware     21
5   SoftwareSoftware     37
6    ServiceSoftware     20
7    SoftwareService     13
8    HardwareService     21
9    SoftwareService     26
10  HardwareHardware     18
11   SoftwareService     17
12   ServiceHardware     13
13   ServiceSoftware     24
14   SoftwareService     29
15   ServiceSoftware     26
16  HardwareHardware     23
17   HardwareService     27
18  SoftwareSoftware     16
19   HardwareService     11

This can also be done by using the add funciton

**example -- df.add(df1)**